============================================================================================================================================
Layer (type:depth-idx)                   Input Shape               Output Shape              Param #                   Kernel Shape
============================================================================================================================================
UNetDenoiseAttack                        [32, 3, 256, 256]         [32, 3, 256, 256]         --                        --
├─DoubleConv: 1-1                        [32, 1, 256, 256]         [32, 16, 256, 256]        --                        --
│    └─Sequential: 2-1                   [32, 1, 256, 256]         [32, 16, 256, 256]        --                        --
│    │    └─Conv2d: 3-1                  [32, 1, 256, 256]         [32, 16, 256, 256]        144                       [3, 3]
│    │    └─BatchNorm2d: 3-2             [32, 16, 256, 256]        [32, 16, 256, 256]        32                        --
│    │    └─ReLU: 3-3                    [32, 16, 256, 256]        [32, 16, 256, 256]        --                        --
│    │    └─Conv2d: 3-4                  [32, 16, 256, 256]        [32, 16, 256, 256]        2,304                     [3, 3]
│    │    └─BatchNorm2d: 3-5             [32, 16, 256, 256]        [32, 16, 256, 256]        32                        --
│    │    └─ReLU: 3-6                    [32, 16, 256, 256]        [32, 16, 256, 256]        --                        --
├─Sequential: 1-2                        [32, 16, 256, 256]        [32, 32, 128, 128]        --                        --
│    └─MaxPool2d: 2-2                    [32, 16, 256, 256]        [32, 16, 128, 128]        --                        2
│    └─DoubleConv: 2-3                   [32, 16, 128, 128]        [32, 32, 128, 128]        --                        --
│    │    └─Sequential: 3-7              [32, 16, 128, 128]        [32, 32, 128, 128]        13,952                    --
├─Sequential: 1-3                        [32, 32, 128, 128]        [32, 64, 64, 64]          --                        --
│    └─MaxPool2d: 2-4                    [32, 32, 128, 128]        [32, 32, 64, 64]          --                        2
│    └─DoubleConv: 2-5                   [32, 32, 64, 64]          [32, 64, 64, 64]          --                        --
│    │    └─Sequential: 3-8              [32, 32, 64, 64]          [32, 64, 64, 64]          55,552                    --
├─Sequential: 1-4                        [32, 64, 64, 64]          [32, 128, 32, 32]         --                        --
│    └─MaxPool2d: 2-6                    [32, 64, 64, 64]          [32, 64, 32, 32]          --                        2
│    └─DoubleConv: 2-7                   [32, 64, 32, 32]          [32, 128, 32, 32]         --                        --
│    │    └─Sequential: 3-9              [32, 64, 32, 32]          [32, 128, 32, 32]         221,696                   --
├─Sequential: 1-5                        [32, 128, 32, 32]         [32, 256, 16, 16]         --                        --
│    └─MaxPool2d: 2-8                    [32, 128, 32, 32]         [32, 128, 16, 16]         --                        2
│    └─DoubleConv: 2-9                   [32, 128, 16, 16]         [32, 256, 16, 16]         --                        --
│    │    └─Sequential: 3-10             [32, 128, 16, 16]         [32, 256, 16, 16]         885,760                   --
├─Sequential: 1-6                        [32, 256, 16, 16]         [32, 512, 8, 8]           --                        --
│    └─MaxPool2d: 2-10                   [32, 256, 16, 16]         [32, 256, 8, 8]           --                        2
│    └─DoubleConv: 2-11                  [32, 256, 8, 8]           [32, 512, 8, 8]           --                        --
│    │    └─Sequential: 3-11             [32, 256, 8, 8]           [32, 512, 8, 8]           3,540,992                 --
├─ConvTranspose2d: 1-7                   [32, 512, 8, 8]           [32, 256, 16, 16]         524,544                   [2, 2]
├─DoubleConv: 1-8                        [32, 512, 16, 16]         [32, 256, 16, 16]         --                        --
│    └─Sequential: 2-12                  [32, 512, 16, 16]         [32, 256, 16, 16]         --                        --
│    │    └─Conv2d: 3-12                 [32, 512, 16, 16]         [32, 256, 16, 16]         1,179,648                 [3, 3]
│    │    └─BatchNorm2d: 3-13            [32, 256, 16, 16]         [32, 256, 16, 16]         512                       --
│    │    └─ReLU: 3-14                   [32, 256, 16, 16]         [32, 256, 16, 16]         --                        --
│    │    └─Conv2d: 3-15                 [32, 256, 16, 16]         [32, 256, 16, 16]         589,824                   [3, 3]
│    │    └─BatchNorm2d: 3-16            [32, 256, 16, 16]         [32, 256, 16, 16]         512                       --
│    │    └─ReLU: 3-17                   [32, 256, 16, 16]         [32, 256, 16, 16]         --                        --
├─ConvTranspose2d: 1-9                   [32, 256, 16, 16]         [32, 128, 32, 32]         131,200                   [2, 2]
├─DoubleConv: 1-10                       [32, 256, 32, 32]         [32, 128, 32, 32]         --                        --
│    └─Sequential: 2-13                  [32, 256, 32, 32]         [32, 128, 32, 32]         --                        --
│    │    └─Conv2d: 3-18                 [32, 256, 32, 32]         [32, 128, 32, 32]         294,912                   [3, 3]
│    │    └─BatchNorm2d: 3-19            [32, 128, 32, 32]         [32, 128, 32, 32]         256                       --
│    │    └─ReLU: 3-20                   [32, 128, 32, 32]         [32, 128, 32, 32]         --                        --
│    │    └─Conv2d: 3-21                 [32, 128, 32, 32]         [32, 128, 32, 32]         147,456                   [3, 3]
│    │    └─BatchNorm2d: 3-22            [32, 128, 32, 32]         [32, 128, 32, 32]         256                       --
│    │    └─ReLU: 3-23                   [32, 128, 32, 32]         [32, 128, 32, 32]         --                        --
├─ConvTranspose2d: 1-11                  [32, 128, 32, 32]         [32, 64, 64, 64]          32,832                    [2, 2]
├─DoubleConv: 1-12                       [32, 128, 64, 64]         [32, 64, 64, 64]          --                        --
│    └─Sequential: 2-14                  [32, 128, 64, 64]         [32, 64, 64, 64]          --                        --
│    │    └─Conv2d: 3-24                 [32, 128, 64, 64]         [32, 64, 64, 64]          73,728                    [3, 3]
│    │    └─BatchNorm2d: 3-25            [32, 64, 64, 64]          [32, 64, 64, 64]          128                       --
│    │    └─ReLU: 3-26                   [32, 64, 64, 64]          [32, 64, 64, 64]          --                        --
│    │    └─Conv2d: 3-27                 [32, 64, 64, 64]          [32, 64, 64, 64]          36,864                    [3, 3]
│    │    └─BatchNorm2d: 3-28            [32, 64, 64, 64]          [32, 64, 64, 64]          128                       --
│    │    └─ReLU: 3-29                   [32, 64, 64, 64]          [32, 64, 64, 64]          --                        --
├─ConvTranspose2d: 1-13                  [32, 64, 64, 64]          [32, 32, 128, 128]        8,224                     [2, 2]
├─DoubleConv: 1-14                       [32, 64, 128, 128]        [32, 32, 128, 128]        --                        --
│    └─Sequential: 2-15                  [32, 64, 128, 128]        [32, 32, 128, 128]        --                        --
│    │    └─Conv2d: 3-30                 [32, 64, 128, 128]        [32, 32, 128, 128]        18,432                    [3, 3]
│    │    └─BatchNorm2d: 3-31            [32, 32, 128, 128]        [32, 32, 128, 128]        64                        --
│    │    └─ReLU: 3-32                   [32, 32, 128, 128]        [32, 32, 128, 128]        --                        --
│    │    └─Conv2d: 3-33                 [32, 32, 128, 128]        [32, 32, 128, 128]        9,216                     [3, 3]
│    │    └─BatchNorm2d: 3-34            [32, 32, 128, 128]        [32, 32, 128, 128]        64                        --
│    │    └─ReLU: 3-35                   [32, 32, 128, 128]        [32, 32, 128, 128]        --                        --
├─ConvTranspose2d: 1-15                  [32, 32, 128, 128]        [32, 16, 256, 256]        2,064                     [2, 2]
├─DoubleConv: 1-16                       [32, 32, 256, 256]        [32, 16, 256, 256]        --                        --
│    └─Sequential: 2-16                  [32, 32, 256, 256]        [32, 16, 256, 256]        --                        --
│    │    └─Conv2d: 3-36                 [32, 32, 256, 256]        [32, 16, 256, 256]        4,608                     [3, 3]
│    │    └─BatchNorm2d: 3-37            [32, 16, 256, 256]        [32, 16, 256, 256]        32                        --
│    │    └─ReLU: 3-38                   [32, 16, 256, 256]        [32, 16, 256, 256]        --                        --
│    │    └─Conv2d: 3-39                 [32, 16, 256, 256]        [32, 16, 256, 256]        2,304                     [3, 3]
│    │    └─BatchNorm2d: 3-40            [32, 16, 256, 256]        [32, 16, 256, 256]        32                        --
│    │    └─ReLU: 3-41                   [32, 16, 256, 256]        [32, 16, 256, 256]        --                        --
├─Conv2d: 1-17                           [32, 16, 256, 256]        [32, 1, 256, 256]         17                        [1, 1]
============================================================================================================================================
Total params: 7,778,321
Trainable params: 7,778,321
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 135.43
============================================================================================================================================
Input size (MB): 25.17
Forward/backward pass size (MB): 4731.17
Params size (MB): 31.11
Estimated Total Size (MB): 4787.45
============================================================================================================================================